/**
 * 商品データマスター
 */
const productMaster = {
    // --- 既存のサンプル (動作確認用) ---
    "4580347721500": { name: "ライフプレミアム 天然水 2L", price: 98, category: "飲料・水" },
    "4901335109634": { name: "ライフオリジナル ポテトチップス　ポテトチップス うすしお味 60g", price: 128, category: "菓子" },
    
    // --- 加工肉 ---
    "4902586066288": { name: "スマイルライフ 切り落としベーコン 180g", price: 386, category: "加工肉" },
    "4901901124122": { name: "スマイルライフ フィッシュソーセージ 1束 (65g×5)", price: 298, category: "加工肉" },
    "4902586262840": { name: "スマイルライフロースハム 90g", price: 258, category: "加工肉" },
    "4902586262970": { name: "スマイルライフ ハーフベーコン 80g", price: 238, category: "加工肉" },
    // --- 納豆・練物・豆腐 ---
    "4971958025628": { name: "スマイルライフ 国産小結びしらたき 6粒入", price: 128, category: "納豆・練物・豆腐" },
    "4901530201683": { name: "スマイルライフ さつま揚 6枚入", price: 198, category: "納豆・練物・豆腐" },
    "4901530201706": { name: "スマイルライフ ふんわりはんぺん 1枚入", price: 108, category: "納豆・練物・豆腐" },
    "4901320265260": { name: "スマイルライフ かまぼこ 赤 80g", price: 158, category: "納豆・練物・豆腐" },
    // --- 飲料・水 (一般食品) ---
    "4535582304032": { name: "スマイルライフ ほうじ茶 500ml", price: 88, category: "飲料・水" },
    "4535582304018": { name: "スマイルライフ 緑茶 500ml", price: 88, category: "飲料・水" },
    "4535582304025": { name: "スマイルライフ ジャスミン茶 500ml", price: 88, category: "飲料・水" },
    "4939505130737": { name: "スマイルライフ 烏龍茶 500ml", price: 88, category: "飲料・水" },

};

